In [1]:
#Get CWD
import os
import csv
import pandas as pd

In [2]:
path = os.getcwd()

In [3]:
path

'C:\\Users\\gibra\\Desktop\\Data Science 2023\\Portfolio\\SQL\\SQL with Python'

# **Library for SQL in Python**

In [4]:
#Import SQL
import sqlite3

In [5]:
# Connect to a database (creates a new database if it doesn't exist)
conn = sqlite3.connect('database.db')

In [6]:
#Create a cursor object to execute SQL statements
cursor = conn.cursor()

# **SQL Queries**

## **Attributes**

In [7]:
'''This query can be used  to retrieve the attribute names of a table'''
table_name = 'EMPLOYEES'
query = f"PRAGMA table_info({table_name})"

cursor.execute(query)
columns = cursor.fetchall()

# Extract attribute names
attribute_names = [(column[1], column[2]) for column in columns]
attribute_names

[('EMP_ID', 'CHAR(9)'),
 ('F_NAME', 'VARCHAR(15)'),
 ('L_NAME', 'VARCHAR(15)'),
 ('SSN', 'CHAR(9)'),
 ('B_DATE', 'DATE'),
 ('SEX', 'CHAR'),
 ('ADDRESS', 'VARCHAR(30)'),
 ('JOB_ID', 'CHAR(9)'),
 ('SALARY', 'DECIMAL(10,2)'),
 ('MANAGER_ID', 'CHAR(9)'),
 ('DEP_ID', 'CHAR(9)')]

In [8]:
'''Another way is to use the sqlilte_master to find our desired table and get that table's definition'''
query = f"SELECT sql FROM sqlite_master WHERE type = 'table' AND name = '{table_name}';"
cursor.execute(query)
result = cursor.fetchone()

# Extract and print the SQL statement
if result:
    table_definition = result[0]
    print("Table Definition:", table_definition)
else:
    print(f"Table '{table_name}' not found.")

Table Definition: CREATE TABLE EMPLOYEES (
    EMP_ID CHAR(9) NOT NULL,
    F_NAME VARCHAR(15) NOT NULL,
    L_NAME VARCHAR(15) NOT NULL,
    SSN CHAR(9),
    B_DATE DATE,
    SEX CHAR,
    ADDRESS VARCHAR(30),
    JOB_ID CHAR(9),
    SALARY DECIMAL(10,2),
    MANAGER_ID CHAR(9),
    DEP_ID CHAR(9) NOT NULL,
    PRIMARY KEY (EMP_ID))

## **Like**

In [9]:
'''This query can be used  to retrieve employees whose address contains a certain city'''
like_query = f"SELECT * FROM EMPLOYEES WHERE ADDRESS LIKE '%Elgin,IL'"
cursor.execute(like_query)
rows = cursor.fetchall()

for row in rows:
    print(row)

('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')

In [10]:
'''This query can be used  to retrieve employees whose date of birth is within a certain decade'''
like_query = f"SELECT * FROM EMPLOYEES WHERE B_DATE LIKE '%197%'"
cursor.execute(like_query)
rows = cursor.fetchall()

for row in rows:
    print(row)

('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2')
('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2')
('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7')

## **Equal**

In [11]:
'''This query can be used  to retrieve employees whose Department ID is equal to five'''
equal_query = f"SELECT * FROM EMPLOYEES WHERE DEP_ID = '5'"
cursor.execute(equal_query)
rows = cursor.fetchall()

for row in rows:
    print(row)

('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5')
('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5')
('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')

## **Range**

In [12]:
'''This query can be used  to retrieve employees whose Salary is in the range between 60,000 and 70,000'''
range_query = f"SELECT * FROM EMPLOYEES WHERE SALARY BETWEEN 60000 AND 70000"
cursor.execute(range_query)
rows = cursor.fetchall()

for row in rows:
    print(row)

('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5')
('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2')
('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7')
('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7')
('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')

## **Equal AND Range**

In [21]:
'''This query can be used  to retrieve employees whose Salary is in the range between 60,000 and 70,000'''
range_query = f"SELECT * FROM EMPLOYEES WHERE DEP_ID = 5 AND SALARY BETWEEN 60000 AND 70000"
cursor.execute(range_query)
rows = cursor.fetchall()

for row in rows:
    print(row)

('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')

## **Order**

In [13]:
'''This query can be used  to retrieve employees ordered by department ID (ascending)'''
order_query = f"SELECT * FROM EMPLOYEES ORDER BY DEP_ID"
cursor.execute(order_query)
rows = cursor.fetchall()

for row in rows:
    print(row)

('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2')
('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2')
('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5')
('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5')
('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')
('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7')
('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7')
('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7')

In [14]:
'''This query can be used  to retrieve employees ordered by department ID (descending)'''
order_query_desc = f"SELECT * FROM EMPLOYEES ORDER BY DEP_ID DESC"
cursor.execute(order_query_desc)
rows = cursor.fetchall()

for row in rows:
    print(row)

('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7')
('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7')
('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7')
('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5')
('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5')
('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')
('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2')
('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2')

In [15]:
'''This query can be used  to retrieve employees ordered by department ID, ad within that department ID, order in descending order by last name'''
order_query_mult = f"SELECT * FROM EMPLOYEES ORDER BY DEP_ID DESC, L_NAME DESC"
cursor.execute(order_query_mult)
rows = cursor.fetchall()

for row in rows:
    print(row)

('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7')
('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7')
('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7')
('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5')
('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5')
('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')
('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2')
('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2')

## **Group By**

### **Count**

In [16]:
'''This query counts the number of IDs in the department ID column (total count of a column=10), and then groups them by Department ID 
total count of dep_ID 2 = 3, total count of dept_ID 5 = 4, .... 3)'''

groupby_count_query = f"SELECT DEP_ID, COUNT(DEP_ID) FROM EMPLOYEES GROUP BY DEP_ID"
cursor.execute(groupby_count_query)
rows = cursor.fetchall()

for row in rows:
    print(row)

('2', 3)
('5', 4)
('7', 3)

### **Average**

In [17]:
'''This query counts the number of IDs in the department ID column (total count of a column=10), and then groups them by Department ID 
total count of dep_ID 2 = 3, total count of dept_ID 5 = 4, .... 3), AND SAME PROCESS FOR AVERAGE'''

groupby_avg_query = f"SELECT DEP_ID, COUNT(DEP_ID), AVG(SALARY) FROM EMPLOYEES GROUP BY DEP_ID"
cursor.execute(groupby_avg_query)
rows = cursor.fetchall()

for row in rows:
    dep_id, employee_count, avg_salary = row
    print(f"Department ID: {dep_id}, Employee Count: {employee_count}, Average Salary: {avg_salary:.2f}")

Department ID: 2, Employee Count: 3, Average Salary: 86666.67
Department ID: 5, Employee Count: 4, Average Salary: 65000.00
Department ID: 7, Employee Count: 3, Average Salary: 66666.67

### **Labeling**

#### **AS**

In [18]:
'''This query counts the number of IDs in the department ID column (total count of a column=10), and then groups them by Department ID 
total count of dep_ID 2 = 3, total count of dept_ID 5 = 4, .... 3), AND SAME PROCESS FOR AVERAGE
THEN it labels the newly created columns as NUM_EMPLOYEES and AVG_SALARY respectively'''

label_query = f'''SELECT DEP_ID, COUNT(DEP_ID) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY" FROM EMPLOYEES GROUP BY DEP_ID'''
cursor.execute(label_query)
rows = cursor.fetchall()

for row in rows:
    print(row)

('2', 3, 86666.66666666667)
('5', 4, 65000.0)
('7', 3, 66666.66666666667)

#### **Using the labels**

In [19]:
'''This query uses the newly created label to order the just calculated average salary'''

use_label_query = f'''SELECT DEP_ID, count(DEP_ID), AVG(SALARY) AS "AVG_SALARY" FROM EMPLOYEES GROUP BY DEP_ID ORDER BY AVG_SALARY'''
cursor.execute(use_label_query)
rows = cursor.fetchall()

for row in rows:
    print(row)

('5', 4, 65000.0)
('7', 3, 66666.66666666667)
('2', 3, 86666.66666666667)

### **Having**

In [23]:
'''This query adds a condition to a previously grouped by information. In this case, show the dep id for departments with avg salary higher than 65000'''

having_groupby_query = f'''
SELECT DEP_ID, count(DEP_ID) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY" 
FROM EMPLOYEES 
GROUP BY DEP_ID 
HAVING AVG_SALARY > 65000 
ORDER BY AVG_SALARY'''

cursor.execute(having_groupby_query)
rows = cursor.fetchall()

for row in rows:
    print(row)

('7', 3, 66666.66666666667)
('2', 3, 86666.66666666667)